#### Terraform Initialization `success`
#### Terraform Plan `success`
#### Pusher: renovate[bot], Action: `pull_request`

<details><summary>Show Plan</summary>

```text
terraform
sakuracloud_ssh_key_gen.gen_key: Refreshing state... [id=113600078862]
sakuracloud_internet.k8s_external_switch: Refreshing state... [id=113600078866]
sakuracloud_switch.k8s_internal_switch: Refreshing state... [id=113600078869]
data.sakuracloud_archive.ubuntu_archive: Reading...
sakuracloud_disk.k8s_rook_disk[3]: Refreshing state... [id=113600078867]
sakuracloud_disk.k8s_rook_disk[5]: Refreshing state... [id=113600078865]
sakuracloud_disk.k8s_rook_disk[0]: Refreshing state... [id=113600078891]
sakuracloud_disk.k8s_rook_disk[2]: Refreshing state... [id=113600078894]
sakuracloud_disk.k8s_rook_disk[7]: Refreshing state... [id=113600078893]
sakuracloud_disk.k8s_rook_disk[4]: Refreshing state... [id=113600078889]
data.sakuracloud_archive.ubuntu_archive: Read complete after 3s [id=113600510456]
sakuracloud_disk.k8s_rook_disk[1]: Refreshing state... [id=113600078895]
sakuracloud_disk.k8s_rook_disk[6]: Refreshing state... [id=113600078892]
sakuracloud_disk.k8s_router_disk[0]: Refreshing state... [id=113600078864]
sakuracloud_disk.k8s_worker_node_disk[1]: Refreshing state... [id=113600078870]
sakuracloud_disk.k8s_worker_node_disk[3]: Refreshing state... [id=113600078883]
sakuracloud_disk.k8s_worker_node_disk[4]: Refreshing state... [id=113600078890]
sakuracloud_disk.k8s_worker_node_disk[7]: Refreshing state... [id=113600078896]
sakuracloud_disk.k8s_worker_node_disk[6]: Refreshing state... [id=113600078863]
sakuracloud_disk.k8s_worker_node_disk[5]: Refreshing state... [id=113600078875]
sakuracloud_disk.k8s_worker_node_disk[2]: Refreshing state... [id=113600078879]
sakuracloud_disk.k8s_worker_node_disk[0]: Refreshing state... [id=113600078872]
sakuracloud_disk.k8s_control_plane_disk[1]: Refreshing state... [id=113600078878]
sakuracloud_disk.k8s_control_plane_disk[0]: Refreshing state... [id=113600078868]
sakuracloud_disk.k8s_control_plane_disk[2]: Refreshing state... [id=113600078873]
sakuracloud_server.k8s_router[0]: Refreshing state... [id=113600078897]
sakuracloud_server.k8s_worker_node[1]: Refreshing state... [id=113600078924]
sakuracloud_server.k8s_worker_node[2]: Refreshing state... [id=113600078921]
sakuracloud_server.k8s_worker_node[4]: Refreshing state... [id=113600078939]
sakuracloud_server.k8s_worker_node[7]: Refreshing state... [id=113600078923]
sakuracloud_server.k8s_worker_node[5]: Refreshing state... [id=113600078922]
sakuracloud_server.k8s_worker_node[3]: Refreshing state... [id=113600078918]
sakuracloud_server.k8s_worker_node[0]: Refreshing state... [id=113600078944]
sakuracloud_server.k8s_worker_node[6]: Refreshing state... [id=113600078920]
sakuracloud_server.k8s_control_plane[1]: Refreshing state... [id=113600078905]
sakuracloud_server.k8s_control_plane[2]: Refreshing state... [id=113600078900]
sakuracloud_server.k8s_control_plane[0]: Refreshing state... [id=113600078901]
sakuracloud_subnet.bgp_subnet: Refreshing state... [id=15770]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # sakuracloud_disk.k8s_control_plane_disk[0] must be replaced
-/+ resource "sakuracloud_disk" "k8s_control_plane_disk" {
      ~ id                = "113600078868" -> (known after apply)
        name              = "k8s-dev-control-plane-1"
      ~ server_id         = "113600078901" -> (known after apply)
      ~ source_archive_id = "113402076879" -> "113600510456" # forces replacement
        tags              = [
            "dev",
            "k8s",
        ]
      ~ zone              = "tk1b" -> (known after apply)
        # (6 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # sakuracloud_disk.k8s_control_plane_disk[1] must be replaced
-/+ resource "sakuracloud_disk" "k8s_control_plane_disk" {
      ~ id                = "113600078878" -> (known after apply)
        name              = "k8s-dev-control-plane-2"
      ~ server_id         = "113600078905" -> (known after apply)
      ~ source_archive_id = "113402076879" -> "113600510456" # forces replacement
        tags              = [
            "dev",
            "k8s",
        ]
      ~ zone              = "tk1b" -> (known after apply)
        # (6 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # sakuracloud_disk.k8s_control_plane_disk[2] must be replaced
-/+ resource "sakuracloud_disk" "k8s_control_plane_disk" {
      ~ id                = "113600078873" -> (known after apply)
        name              = "k8s-dev-control-plane-3"
      ~ server_id         = "113600078900" -> (known after apply)
      ~ source_archive_id = "113402076879" -> "113600510456" # forces replacement
        tags              = [
            "dev",
            "k8s",
        ]
      ~ zone              = "tk1b" -> (known after apply)
        # (6 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # sakuracloud_disk.k8s_router_disk[0] must be replaced
-/+ resource "sakuracloud_disk" "k8s_router_disk" {
      ~ id                = "113600078864" -> (known after apply)
        name              = "k8s-dev-router-1"
      ~ server_id         = "113600078897" -> (known after apply)
      ~ source_archive_id = "113402076879" -> "113600510456" # forces replacement
        tags              = [
            "dev",
            "k8s",
        ]
      ~ zone              = "tk1b" -> (known after apply)
        # (6 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # sakuracloud_disk.k8s_worker_node_disk[0] must be replaced
-/+ resource "sakuracloud_disk" "k8s_worker_node_disk" {
      ~ id                = "113600078872" -> (known after apply)
        name              = "k8s-dev-worker-node-1"
      ~ server_id         = "113600078944" -> (known after apply)
      ~ source_archive_id = "113402076879" -> "113600510456" # forces replacement
        tags              = [
            "dev",
            "k8s",
        ]
      ~ zone              = "tk1b" -> (known after apply)
        # (6 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # sakuracloud_disk.k8s_worker_node_disk[1] must be replaced
-/+ resource "sakuracloud_disk" "k8s_worker_node_disk" {
      ~ id                = "113600078870" -> (known after apply)
        name              = "k8s-dev-worker-node-2"
      ~ server_id         = "113600078924" -> (known after apply)
      ~ source_archive_id = "113402076879" -> "113600510456" # forces replacement
        tags              = [
            "dev",
            "k8s",
        ]
      ~ zone              = "tk1b" -> (known after apply)
        # (6 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # sakuracloud_disk.k8s_worker_node_disk[2] must be replaced
-/+ resource "sakuracloud_disk" "k8s_worker_node_disk" {
      ~ id                = "113600078879" -> (known after apply)
        name              = "k8s-dev-worker-node-3"
      ~ server_id         = "113600078921" -> (known after apply)
      ~ source_archive_id = "113402076879" -> "113600510456" # forces replacement
        tags              = [
            "dev",
            "k8s",
        ]
      ~ zone              = "tk1b" -> (known after apply)
        # (6 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # sakuracloud_disk.k8s_worker_node_disk[3] must be replaced
-/+ resource "sakuracloud_disk" "k8s_worker_node_disk" {
      ~ id                = "113600078883" -> (known after apply)
        name              = "k8s-dev-worker-node-4"
      ~ server_id         = "113600078918" -> (known after apply)
      ~ source_archive_id = "113402076879" -> "113600510456" # forces replacement
        tags              = [
            "dev",
            "k8s",
        ]
      ~ zone              = "tk1b" -> (known after apply)
        # (6 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # sakuracloud_disk.k8s_worker_node_disk[4] must be replaced
-/+ resource "sakuracloud_disk" "k8s_worker_node_disk" {
      ~ id                = "113600078890" -> (known after apply)
        name              = "k8s-dev-worker-node-5"
      ~ server_id         = "113600078939" -> (known after apply)
      ~ source_archive_id = "113402076879" -> "113600510456" # forces replacement
        tags              = [
            "dev",
            "k8s",
        ]
      ~ zone              = "tk1b" -> (known after apply)
        # (6 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # sakuracloud_disk.k8s_worker_node_disk[5] must be replaced
-/+ resource "sakuracloud_disk" "k8s_worker_node_disk" {
      ~ id                = "113600078875" -> (known after apply)
        name              = "k8s-dev-worker-node-6"
      ~ server_id         = "113600078922" -> (known after apply)
      ~ source_archive_id = "113402076879" -> "113600510456" # forces replacement
        tags              = [
            "dev",
            "k8s",
        ]
      ~ zone              = "tk1b" -> (known after apply)
        # (6 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # sakuracloud_disk.k8s_worker_node_disk[6] must be replaced
-/+ resource "sakuracloud_disk" "k8s_worker_node_disk" {
      ~ id                = "113600078863" -> (known after apply)
        name              = "k8s-dev-worker-node-7"
      ~ server_id         = "113600078920" -> (known after apply)
      ~ source_archive_id = "113402076879" -> "113600510456" # forces replacement
        tags              = [
            "dev",
            "k8s",
        ]
      ~ zone              = "tk1b" -> (known after apply)
        # (6 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # sakuracloud_disk.k8s_worker_node_disk[7] must be replaced
-/+ resource "sakuracloud_disk" "k8s_worker_node_disk" {
      ~ id                = "113600078896" -> (known after apply)
        name              = "k8s-dev-worker-node-8"
      ~ server_id         = "113600078923" -> (known after apply)
      ~ source_archive_id = "113402076879" -> "113600510456" # forces replacement
        tags              = [
            "dev",
            "k8s",
        ]
      ~ zone              = "tk1b" -> (known after apply)
        # (6 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # sakuracloud_server.k8s_control_plane[0] will be updated in-place
  ~ resource "sakuracloud_server" "k8s_control_plane" {
      ~ disks             = [
          - "113600078868",
        ] -> (known after apply)
        id                = "113600078901"
      ~ memory            = 4 -> 2
        name              = "k8s-dev-control-plane-1"
        tags              = [
            "@nic-double-queue",
            "dev",
            "k8s",
        ]
        # (17 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # sakuracloud_server.k8s_control_plane[1] will be updated in-place
  ~ resource "sakuracloud_server" "k8s_control_plane" {
      ~ disks             = [
          - "113600078878",
        ] -> (known after apply)
        id                = "113600078905"
      ~ memory            = 4 -> 2
        name              = "k8s-dev-control-plane-2"
        tags              = [
            "@nic-double-queue",
            "dev",
            "k8s",
        ]
        # (17 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # sakuracloud_server.k8s_control_plane[2] will be updated in-place
  ~ resource "sakuracloud_server" "k8s_control_plane" {
      ~ disks             = [
          - "113600078873",
        ] -> (known after apply)
        id                = "113600078900"
      ~ memory            = 4 -> 2
        name              = "k8s-dev-control-plane-3"
        tags              = [
            "@nic-double-queue",
            "dev",
            "k8s",
        ]
        # (17 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # sakuracloud_server.k8s_router[0] will be updated in-place
  ~ resource "sakuracloud_server" "k8s_router" {
      ~ core              = 1 -> 2
      ~ disks             = [
          - "113600078864",
        ] -> (known after apply)
        id                = "113600078897"
      ~ memory            = 1 -> 2
        name              = "k8s-dev-router-1"
        tags              = [
            "@nic-double-queue",
            "dev",
            "k8s",
        ]
        # (16 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # sakuracloud_server.k8s_worker_node[0] will be updated in-place
  ~ resource "sakuracloud_server" "k8s_worker_node" {
      ~ disks             = [
          - "113600078872",
          - "113600078891",
        ] -> (known after apply)
        id                = "113600078944"
      ~ memory            = 4 -> 2
        name              = "k8s-dev-worker-node-1"
        tags              = [
            "@nic-double-queue",
            "dev",
            "k8s",
        ]
        # (17 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # sakuracloud_server.k8s_worker_node[1] will be updated in-place
  ~ resource "sakuracloud_server" "k8s_worker_node" {
      ~ disks             = [
          - "113600078870",
          - "113600078895",
        ] -> (known after apply)
        id                = "113600078924"
      ~ memory            = 4 -> 2
        name              = "k8s-dev-worker-node-2"
        tags              = [
            "@nic-double-queue",
            "dev",
            "k8s",
        ]
        # (17 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # sakuracloud_server.k8s_worker_node[2] will be updated in-place
  ~ resource "sakuracloud_server" "k8s_worker_node" {
      ~ disks             = [
          - "113600078879",
          - "113600078894",
        ] -> (known after apply)
        id                = "113600078921"
      ~ memory            = 4 -> 2
        name              = "k8s-dev-worker-node-3"
        tags              = [
            "@nic-double-queue",
            "dev",
            "k8s",
        ]
        # (17 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # sakuracloud_server.k8s_worker_node[3] will be updated in-place
  ~ resource "sakuracloud_server" "k8s_worker_node" {
      ~ disks             = [
          - "113600078883",
          - "113600078867",
        ] -> (known after apply)
        id                = "113600078918"
      ~ memory            = 4 -> 2
        name              = "k8s-dev-worker-node-4"
        tags              = [
            "@nic-double-queue",
            "dev",
            "k8s",
        ]
        # (17 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # sakuracloud_server.k8s_worker_node[4] will be updated in-place
  ~ resource "sakuracloud_server" "k8s_worker_node" {
      ~ disks             = [
          - "113600078890",
          - "113600078889",
        ] -> (known after apply)
        id                = "113600078939"
      ~ memory            = 4 -> 2
        name              = "k8s-dev-worker-node-5"
        tags              = [
            "@nic-double-queue",
            "dev",
            "k8s",
        ]
        # (17 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # sakuracloud_server.k8s_worker_node[5] will be updated in-place
  ~ resource "sakuracloud_server" "k8s_worker_node" {
      ~ disks             = [
          - "113600078875",
          - "113600078865",
        ] -> (known after apply)
        id                = "113600078922"
      ~ memory            = 4 -> 2
        name              = "k8s-dev-worker-node-6"
        tags              = [
            "@nic-double-queue",
            "dev",
            "k8s",
        ]
        # (17 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # sakuracloud_server.k8s_worker_node[6] will be updated in-place
  ~ resource "sakuracloud_server" "k8s_worker_node" {
      ~ disks             = [
          - "113600078863",
          - "113600078892",
        ] -> (known after apply)
        id                = "113600078920"
      ~ memory            = 4 -> 2
        name              = "k8s-dev-worker-node-7"
        tags              = [
            "@nic-double-queue",
            "dev",
            "k8s",
        ]
        # (17 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # sakuracloud_server.k8s_worker_node[7] will be updated in-place
  ~ resource "sakuracloud_server" "k8s_worker_node" {
      ~ disks             = [
          - "113600078896",
          - "113600078893",
        ] -> (known after apply)
        id                = "113600078923"
      ~ memory            = 4 -> 2
        name              = "k8s-dev-worker-node-8"
        tags              = [
            "@nic-double-queue",
            "dev",
            "k8s",
        ]
        # (17 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

Plan: 12 to add, 12 to change, 12 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```

</details>